      $set dialect(ANS85)
       Identification Division.
       Program-Id. HELLOWLD.

       Procedure Division.
       100-Program.
           Display 'Hello, World!'
           Stop Run
           .
           